[{"id":1,"title":"Garlic Feet\n","content":"If you rub fresh garlic on the soles of your feet, about an hour later you can actually taste the garlic. This is because the molecule that causes garlic's smell, allicin, is small enough to penetrate the skin and blood vessels, where it goes all the way up to your mouth and nose.\n","date":"7/9/2021","time":"11:44:41 AM","comment":["Maybe so, but I recommend rubbing it on crusty toast with some olive oil. It's a much more efficient delivery mechanism.","But why would you do this"],"reactions":[3,2,1],"src":"https://media3.giphy.com/media/3o7WIucW89bVVGgsIE/200w.gif?cid=22fc9c39ftxoicqozs9vp7jjm2mw2wwvixh2wjwef95r31p3&rid=200w.gif&ct=g"},{"id":2,"title":"French Holidays ","content":"There is an ongoing debate in France between people who take extended vacations in July (juilletistes) and those who prefer to travel in August (aoûtiens) about which is a better month to enjoy off work.\n","date":"7/9/2021","time":"11:45:40 AM","comment":["Personally I think every month is the best month to enjoy off work.","Paris in July is a hot hell-hole full of tourists. Best time to be far away."],"reactions":[3,1,0],"src":"https://media4.giphy.com/media/3fivmBJos6nOv5TfZw/200w.gif?cid=22fc9c39ccb3r46wm9gat5yodrv8faoby7ni1buh04j34i42&rid=200w.gif&ct=g"},{"id":3,"title":"Stalin ","content":"Stalin, historic leader of the USSR, was a pen-name meaning \"man of steel\". His real name was Ioseb Besarionis dzе Jughashvili.\n","date":"7/9/2021","time":"11:46:22 AM","comment":["Pretty standard practice to use pseudonyms when you’re a revolutionary. You don’t want to make the authorities job easier by being able to trace your family and ancestry.","Lenin and Trosky are also pseudonums"],"reactions":[7,1,0],"src":"https://media2.giphy.com/media/befaYZCgtZfZm/200w.gif?cid=22fc9c39aphlm8eeya0jcql9yvhua503guhoebnbtx57oq0d&rid=200w.gif&ct=g"},{"id":4,"title":"Salmon Migration ","content":"Salmon migration provides Nitrogen, an important nutrient, to forests surrounding estuaries via predation by bears and other animals.\n","date":"7/9/2021","time":"11:47:29 AM","comment":["Damn dawg, it’s almost as if everything on this planet is interconnected flora annnnd mother fuckin fauna.","Salmon are essentially a nutrition transport service that moves calories and fertilizer from the sea to the mountains. Dying salmon provide calories for the base of the food cycle, and eagle shit from the eagles feeding on dead salmon fertilizes the trees on the ridge tops. They aren't just delicious and fun to catch, they are literally the underpinning of the west coast forest ecosystem."],"reactions":[6,2,1],"src":"https://media2.giphy.com/media/mGJHj9B3JmgtcS6bio/200w.gif?cid=22fc9c39qe9ot2ixg1ccekjya7mwtg77shznwltogczj4fhg&rid=200w.gif&ct=g"},{"id":5,"title":"Voyager 1","content":"Among the many things the Voyager 1 spacecraft has recorded on its golden record are the brain waves of a woman recently fallen in love. That woman is Ann Druyan, she was the creative director on the project and she had recently proposed to Carl Sagan.\n","date":"7/9/2021","time":"11:47:43 AM","comment":["among the many things the Voyager 1 spacecraft has recorded on its golden record are the brain waves of a woman recently fallen in love. That woman is Ann Druyan, she was the creative director on the project and she had recently proposed to Carl Sagan.","When it arrives at the machine home world, they'll upgrade it and send it back to us. I've seen the documentary.","Laughing at the idea of aliens finding voyager 1 and skipping past that junk like me swiping away an amber alert on my phone when I’m texting"],"reactions":[7,0,0],"src":"https://www.pulsecarshalton.co.uk/wp-content/uploads/2016/08/jk-placeholder-image.jpg"},{"id":6,"title":"Caduceus","content":"Although the caduceus (the staff with wings and two snakes wrapped around it) is used as a symbol of medicine in the US, it was originally a symbol associated with commerce and thieves.\n","date":"7/9/2021","time":"11:49:22 AM","comment":["There are two relevant snake-staves in Greek mythology. The one specifically associated with medicine is the Asklepian, the rod of Asclepius, which has one snake and no wings. The staff with wings and two snakes is the Caduceus, the staff of Hermes, and Apollo before him. Asclepius is specifically a god of medicine and healing, whereas Hermes is a god of travelers, which includes thieves, merchants, and doctors. Over time, the two got conflated."],"reactions":[2,4,0],"src":"https://media4.giphy.com/media/f7YCJwa0XZbLvW3gav/200w.gif?cid=22fc9c39nutz0plc8m9p1liqu1vaua8esr6cbh0v4monezpu&rid=200w.gif&ct=g"},{"id":7,"title":"No honey for the baby! ","content":"Feeding honey to newborns is discouraged because the paralytic neurotoxin releasing bacteria, C. botulinum, will grow uninhibited in some infants GI tract, and potentially cause hospitalization or death from \"floppy baby syndrome\" ie, death from descending paralysis\n","date":"7/9/2021","time":"11:50:03 AM","comment":["Whoever came up with \"floppy baby syndrome\" to describe the horrific death of an infant through gradual paralysis, is the king of dark humor."],"reactions":[1,0,1],"src":"https://media2.giphy.com/media/NrgsTngsWNjDG/200w.gif?cid=22fc9c39xozhctf4cppcnn2yt9dahxnjau0zloz89wv1vdvc&rid=200w.gif&ct=g"},{"id":8,"title":"Dinosaurs","content":" The idea that an asteroid killed the dinosaurs wasn't a widespread belief until the 1980s\n","date":"7/9/2021","time":"11:50:50 AM","comment":["\"Growing up in the 90s, I recall it being called a leading theory and being taught a few other theories like climate change, disease, etc. As I got older the science came around to \"\"definitely the asteroid\"\" \"","My dad said that when growing up in the 70s he was taught that an ice age killed the dinosaurs and that we were entering a new ice age that could kill us too. I wonder if stuff like that is why older people don’t believe in global warming."],"reactions":[4,0,0],"src":"https://media2.giphy.com/media/fnmsu2lTw3r1e/200w.gif?cid=22fc9c39gp0wuqkfsqs7wkjfiezvvtmneq5cig3uad54p1iq&rid=200w.gif&ct=g"},{"id":9,"title":"Turtles","content":"Turtles are more closely related to birds than lizards and snakes. Turtles and birds are archosauromorphs whereas lizards and snakes are lepidosauromorphs\n","date":"7/9/2021","time":"11:51:31 AM","comment":["Explains why The Great Om came back as a turtle, instead of the giant eagle like he was intending to.","idk what i thought turtles were related to but it wasn’t a lizard or snake"],"reactions":[5,0,0],"src":"https://media3.giphy.com/media/HsGvB8tdhVVC0/200w.gif?cid=22fc9c39h0rpne2tvo8b2uvdrslvvv0sg5cdj4x5d06nte19&rid=200w.gif&ct=g"},{"id":10,"title":"Toilets","content":"Flushing the toilet with the lid down reduces airborne particles and bacteria by up to 50%.\n","date":"7/9/2021","time":"11:52:06 AM","comment":[],"reactions":[2,5,0],"src":"https://media3.giphy.com/media/WuddXZYu9bXJS/200w.gif?cid=22fc9c39n1vwiqdanqmq64hs46no1zhv4jedihgj4k1uj45k&rid=200w.gif&ct=g"},{"id":11,"title":"Mr. Bean","content":"The official name for Mr. Bean is in fact \"Mr.\", as seen in a scene where his passport is visible.","date":"7/9/2021","time":"11:52:27 AM","comment":[],"reactions":[2,2,0],"src":"https://media1.giphy.com/media/mFdnWF1RTI7fi/200w.gif?cid=22fc9c39dgwnvbxu2ccsqoeh2r15hkad8czeaks84gsv8c81&rid=200w.gif&ct=g"},{"id":12,"title":"Footy","content":"In 1963, an \"England vs the rest of the world\" football match was held in commemoration of the 100th anniversary of association football. England won 2-1\n","date":"7/9/2021","time":"11:52:52 AM","comment":[],"reactions":[4,1,1],"src":"https://media0.giphy.com/media/CwauSZ2yeEd0HgRJdi/200w.gif?cid=22fc9c39zgq02xqu55jvubudzgr72q7fd9cfemacwunddzt0&rid=200w.gif&ct=g"},{"id":13,"title":"Death by Chicken ","content":"A man named Jose Luis Ochoa, 35, died while attending an illegal cockfight in 2011 after being stabbed in the leg by a bird with a knife-like spur strapped to its leg.\n","date":"7/9/2021","time":"11:53:15 AM","comment":[],"reactions":[1,3,0],"src":"https://media0.giphy.com/media/l3vR9IEU6nYAmZyoM/200w.gif?cid=22fc9c39bbxygj383soy0eivnjx35sb2owevngfkqg1jpfta&rid=200w.gif&ct=g"}]